package kg.timmitof.keyboard.data.emoji.catalog

internal object SymbolsEmoji {

    private val hearts = listOf(
        "❤️", "🩷", "🧡", "💛", "💚", "💙", "🩵", "💜", "🖤", "🩶",
        "🤍", "🤎", "💔", "❤️‍🔥", "❤️‍🩹", "❣️", "💕", "💞", "💓", "💗",
        "💖", "💘", "💝", "💟"
    )

    private val religion = listOf(
        "☮️", "✝️", "☪️", "🕉️", "☸️", "🪯", "✡️", "🔯", "🕎", "☯️",
        "☦️", "🛐", "⛎"
    )

    private val zodiac = listOf(
        "♈", "♉", "♊", "♋", "♌", "♍", "♎", "♏", "♐", "♑",
        "♒", "♓"
    )

    private val playback = listOf(
        "🔀", "🔁", "🔂", "▶️", "⏩", "⏭️", "⏯️", "◀️", "⏪", "⏮️",
        "🔼", "⏫", "🔽", "⏬", "⏸️", "⏹️", "⏺️", "⏏️", "🎦", "🔅",
        "🔆", "📶", "📳", "📴"
    )

    private val signs = listOf(
        "♀️", "♂️", "⚧️", "✖️", "➕", "➖", "➗", "🟰", "♾️", "‼️",
        "⁉️", "❓", "❔", "❕", "❗", "〰️", "💱", "💲", "⚕️", "♻️",
        "⚜️", "🔱", "📛", "🔰", "⭕", "✅", "☑️", "✔️", "❌", "❎",
        "➰", "➿", "〽️", "✳️", "✴️", "❇️", "©️", "®️", "™️"
    )

    private val arrows = listOf(
        "⬆️", "↗️", "➡️", "↘️", "⬇️", "↙️", "⬅️", "↖️", "↕️", "↔️",
        "↩️", "↪️", "⤴️", "⤵️", "🔃", "🔄", "🔙", "🔚", "🔛", "🔜",
        "🔝"
    )

    private val warnings = listOf(
        "⚠️", "🚸", "⛔", "🚫", "🚳", "🚭", "🚯", "🚱", "🚷", "📵",
        "🔞", "☢️", "☣️"
    )

    private val numbers = listOf(
        "#️⃣", "*️⃣", "0️⃣", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣",
        "8️⃣", "9️⃣", "🔟"
    )

    private val letters = listOf(
        "🔠", "🔡", "🔢", "🔣", "🔤", "🅰️", "🆎", "🅱️", "🆑", "🆒",
        "🆓", "ℹ️", "🆔", "Ⓜ️", "🆕", "🆖", "🅾️", "🆗", "🅿️", "🆘",
        "🆙", "🆚"
    )

    private val japanese = listOf(
        "🈁", "🈂️", "🈷️", "🈶", "🈯", "🉐", "🈹", "🈚", "🈲", "🉑",
        "🈸", "🈴", "🈳", "㊗️", "㊙️", "🈺", "🈵"
    )

    private val shapes = listOf(
        "🔴", "🟠", "🟡", "🟢", "🔵", "🟣", "🟤", "⚫", "⚪", "🟥",
        "🟧", "🟨", "🟩", "🟦", "🟪", "🟫", "⬛", "⬜", "◼️", "◻️",
        "◾", "◽", "▪️", "▫️", "🔶", "🔷", "🔸", "🔹", "🔺", "🔻",
        "💠", "🔘", "🔳", "🔲"
    )

    val emojis: List<String> = hearts + religion + zodiac + playback + signs +
            arrows + warnings + numbers + letters + japanese + shapes
}
